/* automatically generated by rust-bindgen 0.63.0 */

#[repr(u32)]
#[doc = "  @brief GLB AHB clock IP type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_AHB_CLOCK_IP_Type {
    GLB_AHB_CLOCK_IP_CPU = 0,
    GLB_AHB_CLOCK_IP_SDU = 1,
    GLB_AHB_CLOCK_IP_SEC = 2,
    GLB_AHB_CLOCK_IP_DMA_0 = 3,
    GLB_AHB_CLOCK_IP_DMA_1 = 4,
    GLB_AHB_CLOCK_IP_DMA_2 = 5,
    GLB_AHB_CLOCK_IP_CCI = 6,
    GLB_AHB_CLOCK_IP_RF_TOP = 7,
    GLB_AHB_CLOCK_IP_GPIP = 8,
    GLB_AHB_CLOCK_IP_TZC = 9,
    GLB_AHB_CLOCK_IP_EF_CTRL = 10,
    GLB_AHB_CLOCK_IP_SF_CTRL = 11,
    GLB_AHB_CLOCK_IP_EMAC = 12,
    GLB_AHB_CLOCK_IP_UART0 = 13,
    GLB_AHB_CLOCK_IP_UART1 = 14,
    GLB_AHB_CLOCK_IP_UART2 = 15,
    GLB_AHB_CLOCK_IP_UART3 = 16,
    GLB_AHB_CLOCK_IP_SPI = 17,
    GLB_AHB_CLOCK_IP_I2C = 18,
    GLB_AHB_CLOCK_IP_PWM = 19,
    GLB_AHB_CLOCK_IP_TIMER = 20,
    GLB_AHB_CLOCK_IP_IR = 21,
    GLB_AHB_CLOCK_IP_CHECKSUM = 22,
    GLB_AHB_CLOCK_IP_QDEC = 23,
    GLB_AHB_CLOCK_IP_KYS = 24,
    GLB_AHB_CLOCK_IP_I2S = 25,
    GLB_AHB_CLOCK_IP_USB11 = 26,
    GLB_AHB_CLOCK_IP_CAM = 27,
    GLB_AHB_CLOCK_IP_MJPEG = 28,
    GLB_AHB_CLOCK_IP_BT_BLE_NORMAL = 29,
    GLB_AHB_CLOCK_IP_BT_BLE_LP = 30,
    GLB_AHB_CLOCK_IP_ZB_NORMAL = 31,
    GLB_AHB_CLOCK_IP_ZB_LP = 32,
    GLB_AHB_CLOCK_IP_WIFI_NORMAL = 33,
    GLB_AHB_CLOCK_IP_WIFI_LP = 34,
    GLB_AHB_CLOCK_IP_BT_BLE_2_NORMAL = 35,
    GLB_AHB_CLOCK_IP_BT_BLE_2_LP = 36,
    GLB_AHB_CLOCK_IP_EMI_MISC = 37,

    #[doc = "< use XTAL as system clock"]
    GLB_MCU_SYS_CLK_XTAL = 1,
    #[doc = "< use CPUPLL output 400M as system clock"]
    GLB_MCU_SYS_CLK_CPUPLL_400M = 2,
    #[doc = "< use WIFIPLL output 240M as system clock"]
    GLB_MCU_SYS_CLK_WIFIPLL_240M = 3,
    #[doc = "< use WIFIPLL output 320M as system clock"]
    GLB_MCU_SYS_CLK_WIFIPLL_320M = 4,
}
#[repr(u32)]
#[doc = "  @brief GLB dsp system clock type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_DSP_SYS_CLK_Type {
    #[doc = "< use RC32M as system clock frequency"]
    GLB_DSP_SYS_CLK_RC32M = 0,
    #[doc = "< use XTAL as system clock"]
    GLB_DSP_SYS_CLK_XTAL = 1,
    #[doc = "< use WIFIPLL 240M as system clock"]
    GLB_DSP_SYS_CLK_MM_WIFIPLL_240M = 2,
    #[doc = "< use WIFIPLL 320M as system clock"]
    GLB_DSP_SYS_CLK_MM_WIFIPLL_320M = 3,
    #[doc = "< use CPUPLL output 400M as system clock"]
    GLB_DSP_SYS_CLK_CPUPLL_400M = 4,
}
#[repr(u32)]
#[doc = "  @brief GLB dsp pbus clock type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_DSP_SYS_PBCLK_Type {
    #[doc = "< use rc32m as pbus clock"]
    GLB_DSP_SYS_PBCLK_RC32M = 0,
    #[doc = "< use xtal as pbus clock"]
    GLB_DSP_SYS_PBCLK_XTAL = 1,
    #[doc = "< use mm_wifipll_160m_clk as pbus clock"]
    GLB_DSP_SYS_PBCLK_MM_WIFIPLL_160M = 2,
    #[doc = "< use cpupll_160m_clk as pbus clock"]
    GLB_DSP_SYS_PBCLK_CPUPLL_160M = 3,
    #[doc = "< use mm_wifipll_240m_clk as pbus clock"]
    GLB_DSP_SYS_PBCLK_MM_WIFIPLL_240M = 4,
}
#[repr(u32)]
#[doc = "  @brief GLB dsp system clock type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_PLL_REF_CLK_Type {
    #[doc = "< use XTAL as pll ref clock"]
    GLB_PLL_REFCLK_XTAL = 0,
    #[doc = "< use RC32M as pll ref clock"]
    GLB_PLL_REFCLK_RC32M = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLB_WAC_PLL_CFG_BASIC_Type {
    #[doc = "< xxx pll_refdiv_ratio"]
    pub clkpllRefdivRatio: u8,
    #[doc = "< xxx pll_int_frac_sw"]
    pub clkpllIntFracSw: u8,
    #[doc = "< xxx pll_icp_1u"]
    pub clkpllIcp1u: u8,
    #[doc = "< xxx pll_icp_5u"]
    pub clkpllIcp5u: u8,
    #[doc = "< xxx pll_rz"]
    pub clkpllRz: u8,
    #[doc = "< xxx pll_cz"]
    pub clkpllCz: u8,
    #[doc = "< xxx pll_c3"]
    pub clkpllC3: u8,
    #[doc = "< xxx pll_r4_short"]
    pub clkpllR4Short: u8,
    #[doc = "< xxx pll_r4_en"]
    pub clkpllC4En: u8,
    #[doc = "< xxx pll_sel_sample_clk"]
    pub clkpllSelSampleClk: u8,
    #[doc = "< xxx pll_vco_speed"]
    pub clkpllVcoSpeed: u8,
    #[doc = "< xxx pll_sdm_ctrl_hw"]
    pub clkpllSdmCtrlHw: u8,
    #[doc = "< xxx pll_sdm_bypass"]
    pub clkpllSdmBypass: u8,
}
#[test]
fn bindgen_test_layout_GLB_WAC_PLL_CFG_BASIC_Type() {
    const UNINIT: ::core::mem::MaybeUninit<GLB_WAC_PLL_CFG_BASIC_Type> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<GLB_WAC_PLL_CFG_BASIC_Type>(),
        13usize,
        concat!("Size of: ", stringify!(GLB_WAC_PLL_CFG_BASIC_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<GLB_WAC_PLL_CFG_BASIC_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(GLB_WAC_PLL_CFG_BASIC_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllRefdivRatio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllRefdivRatio)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllIntFracSw) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllIntFracSw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllIcp1u) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllIcp1u)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllIcp5u) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllIcp5u)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllRz) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllRz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllCz) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllCz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllC3) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllC3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllR4Short) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllR4Short)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllC4En) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllC4En)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllSelSampleClk) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllSelSampleClk)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllVcoSpeed) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllVcoSpeed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllSdmCtrlHw) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllSdmCtrlHw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllSdmBypass) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllSdmBypass)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLB_WAC_PLL_Cfg_Type {
    #[doc = "< pll basic configuration"]
    pub basicCfg: *const GLB_WAC_PLL_CFG_BASIC_Type,
    #[doc = "< pll sdmin value"]
    pub clkpllSdmin: u32,
}
#[test]
fn bindgen_test_layout_GLB_WAC_PLL_Cfg_Type() {
    const UNINIT: ::core::mem::MaybeUninit<GLB_WAC_PLL_Cfg_Type> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<GLB_WAC_PLL_Cfg_Type>(),
        16usize,
        concat!("Size of: ", stringify!(GLB_WAC_PLL_Cfg_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<GLB_WAC_PLL_Cfg_Type>(),
        8usize,
        concat!("Alignment of ", stringify!(GLB_WAC_PLL_Cfg_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).basicCfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_Cfg_Type),
            "::",
            stringify!(basicCfg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllSdmin) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_WAC_PLL_Cfg_Type),
            "::",
            stringify!(clkpllSdmin)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLB_MU_PLL_CFG_BASIC_Type {
    #[doc = "< xxx pll_refdiv_ratio"]
    pub clkpllRefdivRatio: u8,
    #[doc = "< xxx pll_sel_sample_clk"]
    pub clkpllSelSampleClk: u8,
    #[doc = "< xxx pll_vco_speed"]
    pub clkpllVcoSpeed: u8,
    #[doc = "< xxx pll_even_div_en"]
    pub clkpllEvenDivEn: u8,
    #[doc = "< xxx pll_even_div_ratio"]
    pub clkpllEvenDivRatio: u8,
}
#[test]
fn bindgen_test_layout_GLB_MU_PLL_CFG_BASIC_Type() {
    const UNINIT: ::core::mem::MaybeUninit<GLB_MU_PLL_CFG_BASIC_Type> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<GLB_MU_PLL_CFG_BASIC_Type>(),
        5usize,
        concat!("Size of: ", stringify!(GLB_MU_PLL_CFG_BASIC_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<GLB_MU_PLL_CFG_BASIC_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(GLB_MU_PLL_CFG_BASIC_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllRefdivRatio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_MU_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllRefdivRatio)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllSelSampleClk) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_MU_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllSelSampleClk)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllVcoSpeed) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_MU_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllVcoSpeed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllEvenDivEn) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_MU_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllEvenDivEn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllEvenDivRatio) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_MU_PLL_CFG_BASIC_Type),
            "::",
            stringify!(clkpllEvenDivRatio)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLB_MU_PLL_Cfg_Type {
    #[doc = "< pll basic configuration"]
    pub basicCfg: *const GLB_MU_PLL_CFG_BASIC_Type,
    #[doc = "< pll sdmin value"]
    pub clkpllSdmin: u32,
}
#[test]
fn bindgen_test_layout_GLB_MU_PLL_Cfg_Type() {
    const UNINIT: ::core::mem::MaybeUninit<GLB_MU_PLL_Cfg_Type> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<GLB_MU_PLL_Cfg_Type>(),
        16usize,
        concat!("Size of: ", stringify!(GLB_MU_PLL_Cfg_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<GLB_MU_PLL_Cfg_Type>(),
        8usize,
        concat!("Alignment of ", stringify!(GLB_MU_PLL_Cfg_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).basicCfg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_MU_PLL_Cfg_Type),
            "::",
            stringify!(basicCfg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clkpllSdmin) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GLB_MU_PLL_Cfg_Type),
            "::",
            stringify!(clkpllSdmin)
        )
    );
}
#[repr(u32)]
#[doc = "  @brief GLB CAM clock type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_CAM_CLK_Type {
    #[doc = "< Select XCLK as CAM clock"]
    GLB_CAM_CLK_XCLK = 0,
    #[doc = "< Select WIFIPLL_96M as CAM clock"]
    GLB_CAM_CLK_WIFIPLL_96M = 1,
    #[doc = "< Select CPUPLL_96M as CAM clock"]
    GLB_CAM_CLK_CPUPLL_100M = 2,
}
#[repr(u32)]
#[doc = "  @brief GLB SDH clock type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_SDH_CLK_Type {
    #[doc = "< Select WIFIPLL_96M as SDH clock"]
    GLB_SDH_CLK_WIFIPLL_96M = 0,
    #[doc = "< Select CPUPLL_100M as SDH clock"]
    GLB_SDH_CLK_CPUPLL_100M = 1,
}
#[repr(u32)]
#[doc = "  @brief GLB UART sig swap group type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_UART_SIG_SWAP_GRP_Type {
    #[doc = "< SWAP UART SIG GROUP GPIO0  -  GPIO11"]
    GLB_UART_SIG_SWAP_GRP_GPIO0_GPIO11 = 0,
    #[doc = "< SWAP UART SIG GROUP GPIO12 -  GPIO23"]
    GLB_UART_SIG_SWAP_GRP_GPIO12_GPIO23 = 1,
    #[doc = "< SWAP UART SIG GROUP GPIO24 -  GPIO35"]
    GLB_UART_SIG_SWAP_GRP_GPIO24_GPIO35 = 2,
    #[doc = "< SWAP UART SIG GROUP GPIO36 -  GPIO45"]
    GLB_UART_SIG_SWAP_GRP_GPIO36_GPIO45 = 3,
}
#[repr(u32)]
#[doc = "  @brief GLB I2S output ref clock type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_I2S_OUT_REF_CLK_Type {
    #[doc = "< no output reference clock on I2S_0 ref_clock port"]
    GLB_I2S_OUT_REF_CLK_NONE = 0,
    #[doc = "< output reference clock on I2S_0 ref_clock port"]
    GLB_I2S_OUT_REF_CLK_SRC = 1,
}
#[repr(u32)]
#[doc = "  @brief GLB DMA clock ID type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_DMA_CLK_ID_Type {
    #[doc = "< DMA0 clock ID:channel 0"]
    GLB_DMA0_CLK_CH0 = 0,
    #[doc = "< DMA0 clock ID:channel 1"]
    GLB_DMA0_CLK_CH1 = 1,
    #[doc = "< DMA0 clock ID:channel 2"]
    GLB_DMA0_CLK_CH2 = 2,
    #[doc = "< DMA0 clock ID:channel 3"]
    GLB_DMA0_CLK_CH3 = 3,
    #[doc = "< DMA0 clock ID:channel 4"]
    GLB_DMA0_CLK_CH4 = 4,
    #[doc = "< DMA0 clock ID:channel 5"]
    GLB_DMA0_CLK_CH5 = 5,
    #[doc = "< DMA0 clock ID:channel 6"]
    GLB_DMA0_CLK_CH6 = 6,
    #[doc = "< DMA0 clock ID:channel 7"]
    GLB_DMA0_CLK_CH7 = 7,
    #[doc = "< DMA1 clock ID:channel 0"]
    GLB_DMA1_CLK_CH0 = 8,
    #[doc = "< DMA1 clock ID:channel 1"]
    GLB_DMA1_CLK_CH1 = 9,
    #[doc = "< DMA1 clock ID:channel 2"]
    GLB_DMA1_CLK_CH2 = 10,
    #[doc = "< DMA1 clock ID:channel 3"]
    GLB_DMA1_CLK_CH3 = 11,
}
#[repr(u32)]
#[doc = "  @brief GLB peripheral DMA type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_PERI_DMA_Type {
    #[doc = "< uart_rx"]
    GLB_PERI_DMA_UART0_RX = 0,
    #[doc = "< uart_tx"]
    GLB_PERI_DMA_UART0_TX = 1,
    #[doc = "< uart1_rx"]
    GLB_PERI_DMA_UART1_RX = 2,
    #[doc = "< uart1_tx"]
    GLB_PERI_DMA_UART1_TX = 3,
    #[doc = "< uart2_rx"]
    GLB_PERI_DMA_UART2_RX = 4,
    #[doc = "< uart2_tx"]
    GLB_PERI_DMA_UART2_TX = 5,
    #[doc = "< i2c_0_rx"]
    GLB_PERI_DMA_I2C_0_RX = 6,
    #[doc = "< i2c_0_tx"]
    GLB_PERI_DMA_I2C_0_TX = 7,
    #[doc = "< irtx_tx"]
    GLB_PERI_DMA_IRTX_TX = 8,
    #[doc = "< gpio_tx"]
    GLB_PERI_DMA_GPIO_TX = 9,
    #[doc = "< spi_rx"]
    GLB_PERI_DMA_SPI_RX = 10,
    #[doc = "< spi_tx"]
    GLB_PERI_DMA_SPI_TX = 11,
    #[doc = "< audio_rx"]
    GLB_PERI_DMA_AUDIO_RX = 12,
    #[doc = "< audio_tx"]
    GLB_PERI_DMA_AUDIO_TX = 13,
    #[doc = "< i2c_1_rx"]
    GLB_PERI_DMA_I2C_1_RX = 14,
    #[doc = "< i2c_1_tx"]
    GLB_PERI_DMA_I2C_1_TX = 15,
    #[doc = "< i2s_0_rx"]
    GLB_PERI_DMA_I2S_0_RX = 16,
    #[doc = "< i2s_0_tx"]
    GLB_PERI_DMA_I2S_0_TX = 17,
    #[doc = "< pdm_rx"]
    GLB_PERI_DMA_PDM_RX = 18,
    #[doc = "< padc"]
    GLB_PERI_DMA_PADC = 19,
    #[doc = "< gauge"]
    GLB_PERI_DMA_GAUGE = 20,
    #[doc = "< gpadc"]
    GLB_PERI_DMA_GPADC = 22,
    #[doc = "< gpdac_tx"]
    GLB_PERI_DMA_GPDAC_TX = 23,
}
#[repr(u32)]
#[doc = "  @brief GLB DMA CN selection type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_PERI_DMA_CN_SEL_Type {
    #[doc = "< peripheral DMA channel select DMA0"]
    GLB_PERI_DMA_CN_SEL_DMA0 = 0,
    #[doc = "< peripheral DMA channel select DMA1"]
    GLB_PERI_DMA_CN_SEL_DMA1 = 1,
}
#[repr(u32)]
#[doc = "  @brief GLB clock source type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_IR_CLK_SRC_Type {
    #[doc = "< IR clock source select XCLK"]
    GLB_IR_CLK_SRC_XCLK = 0,
}
#[repr(u32)]
#[doc = "  @brief GLB flash clock type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_SFLASH_CLK_Type {
    #[doc = "< Select WIFIPLL 120M as flash clock"]
    GLB_SFLASH_CLK_120M_WIFIPLL = 0,
    #[doc = "< Select XTAL as flash clock"]
    GLB_SFLASH_CLK_XTAL = 1,
    #[doc = "< Select CPUPLL 100M as flash clock"]
    GLB_SFLASH_CLK_100M_CPUPLL = 2,
    #[doc = "< Select MUXPLL 80M as flash clock"]
    GLB_SFLASH_CLK_80M_MUXPLL = 3,
    #[doc = "< Select BCLK as flash clock"]
    GLB_SFLASH_CLK_BCLK = 4,
    #[doc = "< Select WIFIPLL 96M as flash clock"]
    GLB_SFLASH_CLK_96M_WIFIPLL = 5,
}
#[repr(u32)]
#[doc = "  @brief GLB I2C clock type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_I2C_CLK_Type {
    #[doc = "< Select bus clk as I2C clock"]
    GLB_I2C_CLK_BCLK = 0,
    #[doc = "< Select xclk as I2C clock"]
    GLB_I2C_CLK_XCLK = 1,
}
#[repr(u32)]
#[doc = "  @brief GLB SPI clock type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_SPI_CLK_Type {
    #[doc = "< Select MCU MUXPLL 160M as SPI clock"]
    GLB_SPI_CLK_MCU_MUXPLL_160M = 0,
    #[doc = "< Select xclk as SPI clock"]
    GLB_SPI_CLK_XCLK = 1,
}
#[repr(u32)]
#[doc = "  @brief GLB PWM1 io type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_PWM1_IO_SEL_Type {
    #[doc = "< Select pwm1 io single end"]
    GLB_PWM1_IO_SINGLE_END = 0,
    #[doc = "< Select pwm1 io differential end for BLDC"]
    GLB_PWM1_IO_DIFF_END = 1,
}
#[repr(u32)]
#[doc = "  @brief GLB PWM2 io type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_PWM2_IO_SEL_Type {
    #[doc = "< Select pwm2 io single end"]
    GLB_PWM2_IO_SINGLE_END = 0,
    #[doc = "< Select pwm2 io single end BLDC"]
    GLB_PWM2_IO_SINGLE_END_BLDC = 1,
}
#[repr(u32)]
#[doc = "  @brief GLB PDM io type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_PDM_IO_SEL_Type {
    #[doc = "< Select audio_top PDM"]
    GLB_PDM_IO_SEL_AUDIO_TOP = 0,
    #[doc = "< Select aupdm_top PDM"]
    GLB_PDM_IO_SEL_AUPDM_TOP = 1,
}
#[repr(u32)]
#[doc = "  @brief GLB SPI pad action type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_SPI_PAD_ACT_AS_Type {
    #[doc = "< SPI pad act as slave"]
    GLB_SPI_PAD_ACT_AS_SLAVE = 0,
    #[doc = "< SPI pad act as master"]
    GLB_SPI_PAD_ACT_AS_MASTER = 1,
}
#[repr(u32)]
#[doc = "  @brief GLB AHB software type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_AHB_MCU_SW_Type {
    GLB_AHB_MCU_SW_RSV0 = 0,
    GLB_AHB_MCU_SW_RSV1 = 1,
    GLB_AHB_MCU_SW_WIFI = 4,
    GLB_AHB_MCU_SW_BTDM = 8,
    GLB_AHB_MCU_SW_ZIGBEE = 9,
    GLB_AHB_MCU_SW_BLE2 = 10,
    GLB_AHB_MCU_SW_ZIGBEE2 = 11,
    GLB_AHB_MCU_SW_EMI_MISC = 16,
    GLB_AHB_MCU_SW_PSRAM0_CTRL = 17,
    GLB_AHB_MCU_SW_PSRAM1_CTRL = 18,
    GLB_AHB_MCU_SW_USB_EMAC = 19,
    GLB_AHB_MCU_SW_RSV20 = 20,
    GLB_AHB_MCU_SW_AUDIO = 21,
    GLB_AHB_MCU_SW_SDH = 22,
    GLB_AHB_MCU_SW_RSV23 = 23,
    GLB_AHB_MCU_SW_DMA2 = 24,
    GLB_AHB_MCU_SW_GLB = 32,
    GLB_AHB_MCU_SW_MIX = 33,
    GLB_AHB_MCU_SW_GPIP = 34,
    GLB_AHB_MCU_SW_SEC_DBG = 35,
    GLB_AHB_MCU_SW_SEC_ENG = 36,
    GLB_AHB_MCU_SW_TZ1 = 37,
    GLB_AHB_MCU_SW_TZ2 = 38,
    GLB_AHB_MCU_SW_EFUSE = 39,
    GLB_AHB_MCU_SW_CCI = 40,
    GLB_AHB_MCU_SW_MCU_PERI_BUS = 41,
    GLB_AHB_MCU_SW_RSV42 = 42,
    GLB_AHB_MCU_SW_SF = 43,
    GLB_AHB_MCU_SW_DMA = 44,
    GLB_AHB_MCU_SW_SDU = 45,
    GLB_AHB_MCU_SW_PDS = 46,
    GLB_AHB_MCU_SW_RSV47 = 47,
    GLB_AHB_MCU_SW_UART0 = 48,
    GLB_AHB_MCU_SW_UART1 = 49,
    GLB_AHB_MCU_SW_SPI = 50,
    GLB_AHB_MCU_SW_I2C = 51,
    GLB_AHB_MCU_SW_PWM = 52,
    GLB_AHB_MCU_SW_TIMER = 53,
    GLB_AHB_MCU_SW_IR_REMOTE = 54,
    GLB_AHB_MCU_SW_CHECKSUM = 55,
    GLB_AHB_MCU_SW_IPC = 56,
    GLB_AHB_MCU_SW_I2C1 = 57,
    GLB_AHB_MCU_SW_UART2 = 58,
    GLB_AHB_MCU_SW_I2S = 59,
    GLB_AHB_MCU_SW_AUPDM = 60,
    GLB_AHB_MCU_SW_LZ4 = 61,
    GLB_AHB_MCU_SW_RSV62 = 62,
    GLB_AHB_MCU_SW_RSV63 = 63,
    GLB_AHB_MCU_SW_PWRON_RST = 64,
    GLB_AHB_MCU_SW_CPU_RESET = 65,
    GLB_AHB_MCU_SW_SYS_RESET = 66,
    GLB_AHB_MCU_SW_PICO_RESET = 67,
    GLB_AHB_MCU_SW_CPU2_RESET = 68,
    GLB_AHB_MCU_SW_CHIP_RESET = 69,
    GLB_AHB_MCU_SW_WL_WDT_RESET_MM_EN = 70,
    GLB_AHB_MCU_SW_MMWDT2WL_RST_MSK = 71,
}
#[repr(u32)]
#[doc = "  @brief GLB AHB software type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_AHB_DSP_SW_Type {
    GLB_AHB_DSP_SW_REG_CTRL_SYS_RESET = 0,
    GLB_AHB_DSP_SW_REG_CTRL_PWRON_RST = 2,
    GLB_AHB_DSP_SW_REG_CTRL_MMCPU0_RESET = 8,
    GLB_AHB_DSP_SW_SWRST_MM_MISC = 32,
    GLB_AHB_DSP_SW_SWRST_DMA = 33,
    GLB_AHB_DSP_SW_SWRST_UART0 = 34,
    GLB_AHB_DSP_SW_SWRST_I2C0 = 35,
    GLB_AHB_DSP_SW_SWRST_I2C1 = 36,
    GLB_AHB_DSP_SW_SWRST_IPC = 37,
    GLB_AHB_DSP_SW_SWRST_DMA2D = 38,
    GLB_AHB_DSP_SW_SWRST_SPI = 40,
    GLB_AHB_DSP_SW_SWRST_TIMER = 41,
    GLB_AHB_DSP_SW_SWRST_I2S0 = 42,
    GLB_AHB_DSP_SW_SWRST_I2S1 = 43,
    GLB_AHB_DSP_SW_SWRST_PDM0 = 44,
    GLB_AHB_DSP_SW_SWRST_PDM1 = 45,
    GLB_AHB_DSP_SW_SWRST_PUHS = 47,
    GLB_AHB_DSP_SW_SWRST_SPP_MISC = 64,
    GLB_AHB_DSP_SW_SWRST_SPP_MAIN = 65,
    GLB_AHB_DSP_SW_SWRST_SPP_TSRC = 66,
    GLB_AHB_DSP_SW_SWRST_DP_TSRC = 67,
    GLB_AHB_DSP_SW_SWRST_NR3D_CTRL = 68,
    GLB_AHB_DSP_SW_SWRST_DVP2BUSA = 69,
    GLB_AHB_DSP_SW_SWRST_DVP2BUSB = 70,
    GLB_AHB_DSP_SW_SWRST_DVP2BUSC = 71,
    GLB_AHB_DSP_SW_SWRST_DVP2BUSD = 72,
    GLB_AHB_DSP_SW_SWRST_MIPI = 73,
    GLB_AHB_DSP_SW_SWRST_SPP_REG = 80,
    GLB_AHB_DSP_SW_SWRST_DVP2BUSE = 81,
    GLB_AHB_DSP_SW_SWRST_DVP2BUSF = 82,
    GLB_AHB_DSP_SW_SWRST_DVP2BUSG = 83,
    GLB_AHB_DSP_SW_SWRST_DVP2BUSH = 84,
    GLB_AHB_DSP_SW_SWRST_CODEC_MISC = 96,
    GLB_AHB_DSP_SW_SWRST_MJPEG = 97,
    GLB_AHB_DSP_SW_SWRST_H264 = 98,
    GLB_AHB_DSP_SW_SWRST_MJPEG_DEC = 99,
    GLB_AHB_DSP_SW_SWRST_CNN = 100,
    GLB_AHB_DSP_SW_SWRST_VRAM = 112,
    GLB_AHB_DSP_SW_RG_IS_RST_N = 128,
}
#[repr(u32)]
#[doc = "  @brief GLB dis reset type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_DISRST_Type {
    GLB_DISRST_GPIP = 2,
    GLB_DISRST_SEC_ENG = 4,
    GLB_DISRST_CCI = 8,
    GLB_DISRST_SF = 11,
    GLB_DISRST_UART0 = 16,
    GLB_DISRST_UART1 = 17,
    GLB_DISRST_SPI = 18,
    GLB_DISRST_I2C0 = 19,
    GLB_DISRST_PWM = 20,
    GLB_DISRST_TIMER = 21,
    GLB_DISRST_IR_REMOTE = 22,
    GLB_DISRST_CHECKSUM = 23,
    GLB_DISRST_IPC = 24,
    GLB_DISRST_I2C1 = 25,
    GLB_DISRST_UART2 = 26,
}
#[repr(u32)]
#[doc = "  @brief GLB PKA clock type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_PKA_CLK_Type {
    #[doc = "< Select MCU_BCLK as PKA clock"]
    GLB_PKA_CLK_MCU_BCLK = 0,
    #[doc = "< Select MCU MUXPLL 160M as PKA clock"]
    GLB_PKA_CLK_MCU_MUXPLL_160M = 1,
}
#[repr(u32)]
#[doc = "  @brief GLB MCU software system reset type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GLB_MCU_SW_SYSTEM_Type {
    #[doc = "< mcu reset"]
    GLB_MCU_SW_SYSTEM_CTRL_MCU = 1,
    #[doc = "< lp reset"]
    GLB_MCU_SW_SYSTEM_CTRL_LP = 3,
}
#[repr(u32)]
#[doc = "  @brief BMX arb mode type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BMX_ARB_Type {
    #[doc = "< 0->round-robin"]
    BMX_ARB_ROUND_ROBIN = 0,
    #[doc = "< 1->fix"]
    BMX_ARB_FIX = 1,
}
#[repr(u32)]
#[doc = "  @brief BMX latch type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BMX_LATCH_Type {
    #[doc = "< 0->Latch first error"]
    BMX_LATCH_FIRST_ERROR = 0,
    #[doc = "< 1->Latch last error"]
    BMX_LATCH_LAST_ERROR = 1,
}
#[doc = "  @brief BMX configuration structure type definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BMX_TO_Cfg_Type {
    #[doc = "< 0->fix, 2->round-robin, 3->random"]
    pub arbMod: BMX_ARB_Type,
    #[doc = "< Bus timeout enable: detect slave no reaponse in 1024 cycles"]
    pub timeoutEn: u8,
}
#[test]
fn bindgen_test_layout_BMX_TO_Cfg_Type() {
    const UNINIT: ::core::mem::MaybeUninit<BMX_TO_Cfg_Type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<BMX_TO_Cfg_Type>(),
        8usize,
        concat!("Size of: ", stringify!(BMX_TO_Cfg_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<BMX_TO_Cfg_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(BMX_TO_Cfg_Type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).arbMod) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BMX_TO_Cfg_Type),
            "::",
            stringify!(arbMod)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeoutEn) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BMX_TO_Cfg_Type),
            "::",
            stringify!(timeoutEn)
        )
    );
}
#[repr(u32)]
#[doc = "  @brief BMX bus err type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BMX_BUS_ERR_Type {
    #[doc = "< Bus trustzone decode error"]
    BMX_BUS_ERR_TRUSTZONE_DECODE = 0,
    #[doc = "< Bus addr decode error"]
    BMX_BUS_ERR_ADDR_DECODE = 1,
}
#[repr(u32)]
#[doc = "  @brief BMX bus err interrupt type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BMX_ERR_INT_Type {
    #[doc = "< BMX bus err interrupt"]
    BMX_ERR_INT_ERR = 0,
    #[doc = "< BMX bus err interrupt max num"]
    BMX_ERR_INT_ALL = 1,
}
#[repr(u32)]
#[doc = "  @brief BMX time out interrupt type definition"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BMX_TO_INT_Type {
    #[doc = "< BMX timeout interrupt"]
    BMX_TO_INT_TIMEOUT = 0,
    #[doc = "< BMX timeout interrupt max num"]
